mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xj/s6e2d5xj.svd
        <!-- REGISTER "IRQ019MON" -->
        <register>
          <name>IRQ019MON</name>
          <description>IRQ019 Batch Read Register [BHW]</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QPRCINT5" -->
            <field>
              <name>QPRCINT5</name>
              <description>PC match and RC match interrupt request of QPRC ch.0</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT4" -->
            <field>
              <name>QPRCINT4</name>
              <description>Out-of-range interrupt request of QPRC ch.0</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT3" -->
            <field>
              <name>QPRCINT3</name>
              <description>Count inversion interrupt request of QPRC ch.0</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT2" -->
            <field>
              <name>QPRCINT2</name>
              <description>Overflow / underflow / zero index interrupt request of QPRC ch.0</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT1" -->
            <field>
              <name>QPRCINT1</name>
              <description>PC and RC match interrupt request of QPRC ch.0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT0" -->
            <field>
              <name>QPRCINT0</name>
              <description>PC match interrupt request of QPRC ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ020MON" -->
        <register>
          <name>IRQ020MON</name>
          <description>IRQ020 Batch Read Register [BHW]</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QPRCINT5" -->
            <field>
              <name>QPRCINT5</name>
              <description>PC match and RC match interrupt request of QPRC ch.1</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT4" -->
            <field>
              <name>QPRCINT4</name>
              <description>Out-of-range interrupt request of QPRC ch.1</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT3" -->
            <field>
              <name>QPRCINT3</name>
              <description>Count inversion interrupt request of QPRC ch.1</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT2" -->
            <field>
              <name>QPRCINT2</name>
              <description>Overflow / underflow / zero index interrupt request of QPRC ch.1</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT1" -->
            <field>
              <name>QPRCINT1</name>
              <description>PC and RC match interrupt request of QPRC ch.1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT0" -->
            <field>
              <name>QPRCINT0</name>
              <description>PC match interrupt request of QPRC ch.1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ021MON" -->
        <register>
          <name>IRQ021MON</name>
          <description>IRQ021 Batch Read Register [BHW]</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WAVEINT3" -->
            <field>
              <name>WAVEINT3</name>
              <description>Interrupt request of WFG timer 54 of the MFT unit 0</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT2" -->
            <field>
              <name>WAVEINT2</name>
              <description>Interrupt request of WFG timer 32 of the MFT unit 0</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT1" -->
            <field>
              <name>WAVEINT1</name>
              <description>Interrupt request of WFG timer 10 of the MFT unit 0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT0" -->
            <field>
              <name>WAVEINT0</name>
              <description>Interrupt request of the DTIF (motor emergency stop) of the MFT unit 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ022MON" -->
        <register>
          <name>IRQ022MON</name>
          <description>IRQ022 Batch Read Register [BHW]</description>
          <addressOffset>0x25C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WAVEINT3" -->
            <field>
              <name>WAVEINT3</name>
              <description>Interrupt request of WFG timer 54 of the MFT unit 1</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT2" -->
            <field>
              <name>WAVEINT2</name>
              <description>Interrupt request of WFG timer 32 of the MFT unit 1</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT1" -->
            <field>
              <name>WAVEINT1</name>
              <description>Interrupt request of WFG timer 10 of the MFT unit 1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT0" -->
            <field>
              <name>WAVEINT0</name>
              <description>Interrupt request of the DTIF (motor emergency stop) of the MFT unit 1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ023MON" -->
        <register>
          <name>IRQ023MON</name>
          <description>IRQ023 Batch Read Register [BHW]</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WAVEINT3" -->
            <field>
              <name>WAVEINT3</name>
              <description>Interrupt request of WFG timer 54 of the MFT unit 2</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT2" -->
            <field>
              <name>WAVEINT2</name>
              <description>Interrupt request of WFG timer 32 of the MFT unit 2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT1" -->
            <field>
              <name>WAVEINT1</name>
              <description>Interrupt request of WFG timer 10 of the MFT unit 2</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT0" -->
            <field>
              <name>WAVEINT0</name>
              <description>Interrupt request of the DTIF (motor emergency stop) of the MFT unit 2</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
