mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xj/s6e2d5xj.svd
        <!-- REGISTER "QDCLKR" -->
        <register>
          <name>QDCLKR</name>
          <description>QDCLKR [BHW]</description>
          <addressOffset>0x400</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0F</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QHDIV" -->
            <field>
              <name>QHDIV</name>
              <description>QHDIV</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DBCNT" -->
        <register>
          <name>DBCNT</name>
          <description>DBCNT [BHW]</description>
          <addressOffset>0x404</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXDBEN" -->
            <field>
              <name>TXDBEN</name>
              <description>TXDBEN</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXDBEN" -->
            <field>
              <name>RXDBEN</name>
              <description>RXDBEN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "HYPERBUS" -->
    <peripheral>
      <name>HYPERBUS</name>
      <description>HyperBus Interface</description>
      <version>A</version>
      <groupName>HYPERBUS</groupName>
      <baseAddress>0xD0A05000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "GDC_HYPERBUS" -->
      <interrupt>
        <name>GDC_HYPERBUS</name>
        <value>123</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "CSR" -->
        <register>
          <name>CSR</name>
          <description>Controller Status Register [BHW]</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07010F01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WRSTOERR" -->
            <field>
              <name>WRSTOERR</name>
              <description>RSTO Error in Write Transaction</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WTRSERR" -->
            <field>
              <name>WTRSERR</name>
              <description>Transaction Error in Write Transaction</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WDECERR" -->
            <field>
              <name>WDECERR</name>
              <description>Decode Error in Write Transaction</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WACT" -->
            <field>
              <name>WACT</name>
              <description>Write Transaction Active</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDSSTALL" -->
            <field>
              <name>RDSSTALL</name>
              <description>RDS Stall Error in Read Transaction</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RRSTOERR" -->
            <field>
              <name>RRSTOERR</name>
              <description>RSTO Error in Read Transaction</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RTRSERR" -->
            <field>
              <name>RTRSERR</name>
              <description>Transaction Error in Read Transaction</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDECERR" -->
            <field>
              <name>RDECERR</name>
              <description>Decode Error in Read Transaction</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RACT" -->
            <field>
              <name>RACT</name>
              <description>Read Transaction Active</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IEN" -->
        <register>
          <name>IEN</name>
          <description>Interrupt Enable Register [BHW]</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTP" -->
            <field>
              <name>INTP</name>
              <description>Interrupt Polarity</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RPCINTE" -->
            <field>
              <name>RPCINTE</name>
              <description>HyperBus Memory Interrupt Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ISR" -->
        <register>
          <name>ISR</name>
          <description>Interrupt Status Register [BHW]</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RPCINTS" -->
            <field>
              <name>RPCINTS</name>
              <description>HyperBus Memory Interrupt Status</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
